#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_account.wallet will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "wallet" {
        id                                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01"
        name                                     = "io-p-itn-wallet-cosno-01"
        tags                                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_01["wallet-instances"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "containers_01" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlDatabases/db/containers/wallet-instances"
        name                = "wallet-instances"
        # (5 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 4000 -> 10000
        }

        # (2 unchanged blocks hidden)
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_02["leases"] will be created
  + resource "azurerm_cosmosdb_sql_container" "containers_02" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + database_name       = "db"
      + default_ttl         = (known after apply)
      + id                  = (known after apply)
      + name                = "leases"
      + partition_key_path  = "/id"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 1000
        }
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_02["nonces"] must be replaced
-/+ resource "azurerm_cosmosdb_sql_container" "containers_02" {
      ~ id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlDatabases/db/containers/nonces" -> (known after apply)
        name                  = "nonces"
      - partition_key_version = 2 -> null # forces replacement
      ~ throughput            = 100 -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 1000 -> 4000
        }

      - conflict_resolution_policy {
          - conflict_resolution_path = "/_ts" -> null
          - mode                     = "LastWriterWins" -> null
        }

      - indexing_policy {
          - indexing_mode = "consistent" -> null

          - included_path {
              - path = "/*" -> null
            }
        }
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_02["wallet-instances"] must be replaced
-/+ resource "azurerm_cosmosdb_sql_container" "containers_02" {
      + default_ttl           = (known after apply)
      ~ id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlDatabases/db/containers/wallet-instances" -> (known after apply)
        name                  = "wallet-instances"
      - partition_key_version = 2 -> null # forces replacement
      ~ throughput            = 100 -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 1000 -> 10000
        }

      - conflict_resolution_policy {
          - conflict_resolution_path = "/_ts" -> null
          - mode                     = "LastWriterWins" -> null
        }

      - indexing_policy {
          - indexing_mode = "consistent" -> null

          - included_path {
              - path = "/*" -> null
            }
        }
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "CosmosDbConnectionStringTemp"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=CosmosDbConnectionStringTemp)"
            # (50 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02"
        name                                           = "io-p-itn-wallet-user-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "CosmosDbConnectionStringTemp"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=CosmosDbConnectionStringTemp)"
            # (51 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 4 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
